<?php
/**
 * created by: tushar Khan
 * email : tushar.khan0122@gmail.com
 * date : 9/9/2022
 */


namespace Tusharkhan\BanglaFaker\Lib;

use Tusharkhan\BanglaFaker\BanglaFaker;

class Color extends BanglaFaker
{
    protected static $safeColorNames = [
        'কালো', 'মেরুন', 'সবুজ', 'জলপাই',
        'বেগুনি', 'টিল', 'চুন', 'নীল', 'রূপা',
        'ধূসর', 'হলুদ', 'ফুচিয়া', 'অ্যাকোয়া', 'সাদা'
    ];

    protected static $allColorNames = [
        'অ্যালিসব্লু', 'অ্যান্টিক হোয়াইট', 'অ্যাকোয়া', 'অ্যাকোয়ামেরিন',
        'অ্যাজুর', 'বেইজ', 'বিস্ক', 'ব্ল্যাক', 'ব্লাঞ্চড আলমন্ড',
        'ব্লু', 'ব্লুভায়োলেট', 'ব্রাউন', 'বারলিউড', 'ক্যাডেট ব্লু',
        'চার্ট্রিউস', 'চকলেট', 'কোরাল', 'কর্নফ্লাওয়ার ব্লু',
        'কর্নসিল্ক', 'ক্রিমসন', 'সায়ান', 'ডার্ক ব্লু', 'ডার্কসায়ান',
        'ডার্ক গোল্ডেনরড', 'ডার্ক গ্রে', 'ডার্ক গ্রিন', 'ডার্কখাকি',
        'ডার্কম্যাজেন্টা', 'ডার্ক অলিভ গ্রিন', 'ডার্করেঞ্জ', 'ডার্কঅর্কিড',
        'ডার্করেড', 'ডার্কসালমন', 'ডার্কসিগ্রিন', 'ডার্কস্লেটব্লু',
        'ডার্কস্লেট গ্রে', 'ডার্ক টারকোয়েজ', 'ডার্ক ভায়োলেট', 'ডিপপিঙ্ক',
        'ডিপ স্কাই ব্লু', 'ডিম গ্রে', 'পোরা ইট',
        'ফ্লোরালহোয়াইট', 'ফরেস্ট গ্রিন', 'ফুচিয়া', 'গেইনসবোরো', 'ঘোস্টহোয়াইট',
        'গোল্ড', 'গোল্ডেনরড', 'ধূসর', 'সবুজ', 'গ্রিন ইয়েলো', 'হানিডিউ',
        'হটপিঙ্ক', 'ইন্ডিয়ান রেড', 'ইন্ডিগো', 'আইভরি', 'খাকি', 'ল্যাভেন্ডার',
        'ল্যাভেন্ডার ব্লাশ', 'লনগ্রিন', 'লেমন শিফন', 'হালকা নীল', 'লাইটকোরাল',
        'লাইটসায়ান', 'হালকা গোল্ডেনরোডাইলো', 'উজ্জল ধূসর', 'উজ্জল সবুজ', 'হালকা গোলাপি',
        'লাইট স্যামন', 'হালকা সাগর সবুজ', 'লাইটস্কাই ব্লু', 'লাইটস্লেট গ্রে', 'হালকা ইস্পাত নীল',
        'হালকা হলুদ', 'লাইম', 'লাইমগ্রিন', 'লিনেন', 'ম্যাজেন্টা', 'মেরুন', 'মিডিয়াম অ্যাকোয়ামেরিন',
        'মাঝারি নীল', 'মাঝারি অর্কিড', 'মাঝারি বেগুনি', 'মাঝারি সমুদ্রসবুজ', 'মাঝারি স্লেট নীল',
        'মাঝারি স্প্রিংগ্রিন', 'মাঝারি টারকোয়েজ', 'মাঝারি বেগুনি লাল', 'মিডনাইট ব্লু',
        'মিন্টক্রিম', 'মিস্টিরোজ', 'মোকাসিন', 'নাভাজোহোয়াইট', 'নেভি', 'ওল্ডলেস', 'অলিভ',
        'অলিভড্র্যাব', 'অরেঞ্জ', 'অরেঞ্জ রেড', 'অর্কিড', 'প্যালেগোল্ডেনরড', 'পেলগ্রিন',
        'ফ্যাকাশে ফিরোজা', 'ফ্যাকাশে বেগুনি লাল', 'পাপাইয়াউইপ', 'পিচপাফ', 'পেরু', 'গোলাপী', 'বরই',
        'পাউডার ব্লু', 'বেগুনি', 'লাল', 'রোজিব্রাউন', 'রয়েল ব্লু', 'স্যাডলব্রাউন', 'স্যালমন',
        'স্যান্ডি ব্রাউন', 'সিগ্রিন', 'সিশেল', 'সিয়েনা', 'সিলভার', 'স্কাইব্লু', 'স্লেট ব্লু',
        'স্লেটগ্রে', 'স্নো', 'স্প্রিংগ্রিন', 'স্টিলব্লু', 'ট্যান', 'টিল', 'থিসল', 'টমেটো',
        'ফিরোজা', 'ভায়োলেট', 'গম', 'সাদা', 'হোয়াইট স্মোক', 'হলুদ', 'হলুদ সবুজ',
    ];



    public static function safeColorName()
    {
        return static::randomElement(static::$safeColorNames);
    }


    public static function colorName()
    {
        return static::randomElement(static::$allColorNames);
    }
}
